{"results":[{"id":1,"question":"Do you think education is more important than experience?","category":"Education"},{"id":10,"question":"Do you think it's better to focus on yourself or the community you belong to?","category":"Society"},{"id":11,"question":"Do you prefer reading books or watching movies?","category":"Interests"},{"id":12,"question":"Do you think it's more important to be optimistic or realistic?","category":"Personality"},{"id":13,"question":"Do you think having a well-paying job is more important than job satisfaction?","category":"Career"},{"id":14,"question":"Do you think it's more important to be respectful or assertive?","category":"Ethics"},{"id":15,"question":"Do you prefer cooking or eating out?","category":"Interests"},{"id":16,"question":"Do you think it's more important to be practical or idealistic?","category":"Personality"},{"id":17,"question":"Do you think it's more important to have a diverse skill set or specialize in one area?","category":"Career"},{"id":18,"question":"Do you think it's more important to be respectful of others' opinions or stick to your own beliefs?","category":"Ethics"},{"id":19,"question":"Do you prefer listening to music or playing musical instruments?","category":"Interests"},{"id":2,"question":"Do you prefer living in the city or countryside?","category":"Interests"},{"id":20,"question":"Do you think it's more important to be spontaneous or well-planned?","category":"Personality"},{"id":21,"question":"Would you rather work for a company that is always secure in terms of keeping your job, or one that allows you to change jobs easily?","category":"Career"},{"id":22,"question":"Do you think it's important to never tell a lie?","category":"Ethics"},{"id":23,"question":"Do you prefer nature walks or city walks?","category":"Interests"},{"id":24,"question":"Do you think it's more important to be confident or humble?","category":"Personality"},{"id":25,"question":"Do you think it's more important to work for a company with a good reputation or one with great opportunities for advancement?","category":"Career"},{"id":26,"question":"Do you think it's more important to help others or focus on personal success?","category":"Ethics"},{"id":27,"question":"Do you prefer outdoor activities or indoor activities?","category":"Interests"},{"id":28,"question":"Do you think it's more important to be responsible or to take risks?","category":"Personality"},{"id":29,"question":"Do you think it's more important to work for a company that aligns with your values or one that offers the highest salary?","category":"Career"},{"id":3,"question":"Do you think it's more important to be honest or tactful?","category":"Personality"},{"id":30,"question":"Do you think it's more important to speak your mind or to hold your tongue?","category":"Ethics"},{"id":4,"question":"Do you think internships are more valuable than traditional classroom education?","category":"Education"},{"id":5,"question":"Do you prefer working for a big corporation or a small business?","category":"Career"},{"id":6,"question":"Do you think it's more important to be knowledgeable or intelligent?","category":"Education"},{"id":7,"question":"Do you prefer sports or arts?","category":"Interests"},{"id":8,"question":"Do you think it's more important to be ambitious or content?","category":"Personality"},{"id":9,"question":"Do you think having a strong work ethic is more important than creativity?","category":"Career"}],"meta":{"count":30}}